chore(docs):modified documentation information and routing and checklist
